<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html lang="ko">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Mo-Cozy - 서비스 이용약관</title>

    <link rel="stylesheet" href="./terms.css" />

</head>
<body>
  <div>
    <img src="${pageContext.request.contextPath}/resources/koo/upfile/loginPage_img/logo.png" alt="">
  </div>
  <div class="detail-terms">
    <pre>
이용약관
제1장 총칙
제1조 (목적)
이 약관은 모꼬지(이하 당사)이 제공하는 서비스를 이용함에 있어 당사와 이용자의 권리, 의무 및 책임사항을 규정합니다. 이를 통하여 당사와 이용자는 알아야 할 사항을 숙지, 상호 신뢰의 증진을 목적으로 합니다.

제2조 (약관의 효력 및 변경)
가. 이 약관은 모꼬지 사이트에 회원으로 등록, 조회 등 서비스 이용 순간부터 효력이 발생됩니다.
나. 당사에서는 서비스 이용 수수료 등을 포함하여 각종 약관을 어느 시기에나 변경할 권리를 갖고 있으며 사전 고지 없이 이 약관들의 내용을 변경할 수 있습니다. 변경된 약관은 홈페이지 공지, 회원가입 시 공지 또는 전자우편 등의 기타 방법으로 공지함으로써 효력이 발생됩니다. 당사는 또한 “마지막 수정일”의 날짜를 약관의 가장 상단에 나타낼 것입니다. 이는 서비스 이용약관뿐만 아니라, 결제서비스약관, 환불규정, 개인정보처리방침 약관 모두가 해당됩니다.
다. 기존 회원들은 당사가 변경된 약관의 수정사항을 홈페이지, 어플리케이션 또는 이메일 등의 방법을 통해 공지한 경우, 웹사이트, 어플리케이션 또는 서비스를 지속적으로 이용할 경우에 변경 사항에 대해 동의 한 것으로 간주합니다. 만일 수정 약관에 대해 동의하지 않는 경우에는 사이트와 서비스 이용을 즉시 중단 하거나 탈퇴함으로써 약관의 내용을 거부할 수 있습니다.

제3조 (약관 외 사항의 처리)
본 약관과 개인정보취급방침에 명시되지 않은 사항에 대해서는 관련 법령 및 회사가 정한 서비스 이용 안내에 따릅니다.

제4조 (용어의 정리)

블라블라블라

.......불구하고, 동 분쟁으로 인해 소송이 제기될 경우 소송은 상호 합의 하에 정한 소재 법원으로 합니다. 상호 합의점이 도출되지 않는 경우, 민사상에서 정하는 관할 법원으로 합니다.
부칙
이용약관 내용 추가, 삭제 및 수정이 있을 시에는 개정일로부터 7일전, 회원의 권리 의무에 중대한 영향을 미치는 중요한 사항의 변경인 경우에는 30일 전에 모꼬지사이트 공지사항, 이메일등을 통해 고지합니다.
공고일자 : 2024년 05월 02일
시행일자 : 2024년 01월 08일

    </pre>
  </div>
  
</body>
</html>