<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html lang="ko">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>공지사항 목록</title>
    <link rel="stylesheet" href="${pageContext.request.contextPath}/resources/teo/css/noticePage.css">
    <link rel="stylesheet" href="${pageContext.request.contextPath}/resources/teo/css/clubDetailPage.css">
    <link rel="stylesheet" href="${pageContext.request.contextPath}/resources/teo/css/ajaxPublicApi.css">

    <!-- font awesome -->
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.2/css/all.min.css">

    <!-- 라이브러리 -->
    <script src="https://code.jquery.com/jquery-3.5.1.min.js"></script>
    <!-- <script src="${pageContext.request.contextPath}/resources/teo/js/noticeListView.js"></script> -->
    <script src="${pageContext.request.contextPath}/resources/teo/js/ajaxPublicAPI.js"></script>
</head>
<body>
	<%@ include file="../common/header.jsp"%>
    <div id="wrapper_notice">
        <div id="map_info">
            <img src="${pageContext.request.contextPath}/resources/teo/img/map.png" usemap="#image-map">

            <map id="image_map_map" name="image-map">
                <area onclick="getAirInfo(this)" target="도봉구" alt="도봉구" title="도봉구" coords="315,5,306,24,315,44,323,48,325,56,319,64,317,72,315,78,318,86,327,86,351,110,355,100,361,94,365,97,372,91,371,68,361,57,360,46,363,38,365,24,354,15,339,16,334,4" shape="poly">
                <area onclick="getAirInfo(this)" target="노원구" alt="노원구" title="노원구" coords="367,24,367,38,362,47,363,57,371,67,373,92,369,98,357,99,355,113,361,120,365,131,374,138,388,140,409,128,417,132,423,130,427,125,437,108,435,89,417,84,405,75,417,63,415,42,419,28,415,20,403,22,396,11" shape="poly">
                <area onclick="getAirInfo(this)" target="중랑구" alt="중랑구" title="중랑구" coords="389,141,408,130,417,134,425,133,429,128,436,127,444,133,446,169,435,176,435,187,425,198,414,204,399,204,399,186,389,180,384,162,391,162,394,151" shape="poly">
                <area onclick="getAirInfo(this)" target="강북구" alt="강북구" title="강북구" coords="302,25,291,29,281,38,287,51,282,61,270,67,268,81,277,90,275,102,283,108,296,109,302,119,310,123,317,134,326,135,337,143,347,137,363,129,362,121,350,112,324,87,315,86,316,73,313,65,322,53" shape="poly">
                <area onclick="getAirInfo(this)" target="은평구" alt="은평구" title="은평구" coords="225,69,241,79,251,94,263,106,243,117,234,129,236,141,230,150,221,153,214,167,199,179,187,183,175,190,169,173,175,164,166,139,179,129,185,90,212,85" shape="poly">
                <area onclick="getAirInfo(this)" target="성북구" alt="성북구" title="성북구" coords="390,150,375,153,370,158,359,160,349,163,347,173,342,176,337,186,329,189,308,186,303,174,286,165,284,152,282,129,269,106,275,105,283,111,293,111,299,119,312,136,323,138,332,145,339,148,349,140,362,136" shape="poly">
                <area onclick="getAirInfo(this)" target="종로구" alt="종로구" title="종로구" coords="266,109,246,118,236,131,239,138,234,150,246,162,250,178,247,193,254,202,255,207,267,205,286,208,297,205,325,205,329,199,318,189,306,188,298,176,282,175,273,166,279,153,277,134" shape="poly">
                <area onclick="getAirInfo(this)" target="서대문구" alt="서대문구" title="서대문구" coords="230,152,220,166,205,182,190,188,179,196,187,203,204,212,208,224,230,227,248,224,254,211,242,199,247,178,243,165" shape="poly">
                <area onclick="getAirInfo(this)" target="중구" alt="중구" title="중구" coords="257,213,252,223,257,230,265,229,277,236,307,242,318,229,327,223,329,216,326,208,312,209,300,209,290,213,270,208" shape="poly">
                <area onclick="getAirInfo(this)" target="동대문구" alt="동대문구" title="동대문구" coords="389,154,377,156,373,162,353,166,351,173,343,181,341,189,333,197,337,202,346,197,360,200,365,211,389,219,396,207,394,189,385,182,381,163,390,160" shape="poly">
                <area onclick="getAirInfo(this)" target="마포구" alt="마포구" title="마포구" coords="137,183,138,192,124,196,130,208,147,220,158,224,163,232,185,248,196,252,211,254,224,266,227,258,234,253,240,256,245,249,244,242,253,232,248,225,234,230,205,228,199,214,175,202,165,176,149,174" shape="poly">
                <area onclick="getAirInfo(this)" target="용산구" alt="용산구" title="용산구" coords="249,241,250,251,242,260,235,258,230,263,230,269,235,273,237,278,247,283,257,288,270,290,277,293,292,293,297,288,301,281,319,263,311,257,308,247,280,241,267,234,257,234" shape="poly">
                <area onclick="getAirInfo(this)" target="성동구" alt="성동구" title="성동구" coords="310,245,313,253,318,255,322,259,334,251,361,255,368,261,373,263,377,251,389,237,389,222,363,217,357,203,350,201,342,204,334,204,329,207,335,216,332,223,321,229" shape="poly">
                <area onclick="getAirInfo(this)" target="광진구" alt="광진구" title="광진구" coords="400,208,393,223,395,237,381,251,381,259,375,266,386,277,406,275,418,270,432,249,434,237,429,225,431,218,427,214,427,200,416,210" shape="poly">
                <area onclick="getAirInfo(this)" target="강동구" alt="강동구" title="강동구" coords="443,221,447,214,479,205,508,185,518,193,518,207,529,231,521,245,507,247,494,251,492,261,475,290,464,283,459,275,453,271,455,261,451,252,444,248,447,235" shape="poly">
                <area onclick="getAirInfo(this)" target="송파구" alt="송파구" title="송파구" coords="443,253,449,257,450,264,448,273,454,277,459,286,475,295,481,307,499,312,495,331,489,336,487,349,467,351,465,360,458,362,453,352,444,345,438,331,427,324,421,319,404,312,393,309,387,288,412,287,429,279" shape="poly">
                <area onclick="getAirInfo(this)" target="강남구" alt="강남구" title="강남구" coords="319,278,325,270,337,264,355,267,359,271,368,275,381,288,383,297,389,311,418,323,423,330,435,334,439,344,450,353,454,363,451,376,441,380,433,373,423,375,415,359,407,352,393,356,387,354,381,357,380,362,375,364,359,351,363,346,356,340,347,336,340,328,339,320,326,298" shape="poly">
                <area onclick="getAirInfo(this)" target="서초구" alt="서초구" title="서초구" coords="317,280,310,285,309,293,299,302,275,306,277,313,284,315,285,324,281,331,282,345,276,353,277,359,283,361,291,372,298,366,304,367,311,380,329,382,336,371,341,374,343,407,357,415,367,426,386,423,391,408,411,401,411,391,419,378,411,361,407,356,397,359,389,357,383,362,376,368,354,355,353,346,346,340,335,330,332,320" shape="poly">
                <area onclick="getAirInfo(this)" target="동작구" alt="동작구" title="동작구" coords="181,335,185,324,200,319,203,311,203,304,209,291,224,290,243,292,252,300,266,299,270,303,273,312,280,318,279,324,276,344,273,350,263,350,256,341,257,329,249,321,244,326,236,322,229,323,222,328,215,321,205,322,199,329" shape="poly">
                <area onclick="getAirInfo(this)" target="관악구" alt="관악구" title="관악구" coords="178,347,189,350,191,356,187,363,194,373,196,382,203,385,208,392,213,395,216,403,224,409,250,410,257,401,270,397,277,384,290,377,283,367,276,364,272,357,263,357,254,349,253,333,250,330,243,334,236,329,228,329,226,334,216,329,208,327,202,335,180,339" shape="poly">
                <area onclick="getAirInfo(this)" target="금천구" alt="금천구" title="금천구" coords="141,332,148,334,155,340,157,346,174,348,184,353,182,359,183,367,187,371,190,379,193,386,199,387,204,393,193,408,171,408,169,398,153,375,159,369,155,361,144,352" shape="poly">
                <area onclick="getAirInfo(this)" target="구로구" alt="구로구" title="구로구" coords="75,295,68,314,73,325,74,334,68,344,81,351,99,353,105,341,118,343,130,324,139,327,152,333,157,337,160,343,174,345,174,338,168,331,162,304,151,294,141,299,139,309,129,310,123,303,111,300,100,307,99,314,90,316,86,306" shape="poly">
                <area onclick="getAirInfo(this)" target="영등포구" alt="영등포구" title="영등포구" coords="161,243,158,248,160,256,164,263,160,272,151,280,153,291,164,301,171,328,176,335,183,321,197,316,199,309,205,290,224,287,227,281,216,279,210,265,193,263,181,260" shape="poly">
                <area onclick="getAirInfo(this)" target="양천구" alt="양천구" title="양천구" coords="81,264,77,279,78,292,87,304,90,312,98,312,97,304,108,297,125,299,130,305,135,305,138,295,149,291,145,280,155,271,159,264,155,256,153,246,143,246,136,242,129,242,125,254,127,265,119,273,105,276,97,273,94,259,89,256" shape="poly">
                <area onclick="getAirInfo(this)" target="강서구" alt="강서구" title="강서구" coords="57,150,42,159,46,178,26,196,24,206,8,227,22,243,40,248,47,254,69,249,79,258,88,252,97,255,100,266,104,272,117,269,123,263,122,251,126,240,140,238,146,240,154,242,160,240,155,234,144,232,125,216,112,193,88,184" shape="poly">
            </map>
        </div>
        <div>
            <table id="air_info_place"></table>
        </div>
    </div>
</body>


</html>